TestingTool_3-0/src/InformationRegisters/Планировщик/Планировщик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Планировщик</name>
  <resources>
    <name>Включено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПовтораПриОшибке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПовторовПриОшибке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПродолжатьПриОшибке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Понедельник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Вторник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Среда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Четверг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Пятница</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Суббота</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Воскресенье</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтервалСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончанияСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗапускаСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗавершенияСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Однократно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>CatalogRef.Задания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Интервал</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/InformationRegisters/Планировщик/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьСейчасСервер(Задание)
	ОписаниеОшибки = "";
	Если ПланировщикЗаданийСервер.ДобавитьЗаданиеВПуллНемедленно(Задание,ОписаниеОшибки)=Истина Тогда
		Сообщить("Успешно!");
	Иначе
		Сообщить("Ошибка!"+Символы.ПС+ОписаниеОшибки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСейчас(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВыполнитьСейчасСервер(ТекущиеДанные.Задание);
КонецПроцедуры

&НаСервере
Процедура ИзменитьАктивностьЗадания(Знач Ключ,Знач Активность)
	
	МенеджерЗаписи = РегистрыСведений.Планировщик.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Задание 			= Ключ.Задание;
	МенеджерЗаписи.ВремяНачала 		= Ключ.ВремяНачала;
	МенеджерЗаписи.ВремяОкончания 	= Ключ.ВремяОкончания;
	МенеджерЗаписи.Интервал 		= Ключ.Интервал;
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Включено = Активность;
	
	МенеджерЗаписи.Записать(Истина);	

КонецПроцедуры

&НаКлиенте
Процедура ПереключитьАктивность(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ключ = новый Структура("Задание,ВремяНачала,ВремяОкончания,Интервал");
	ЗаполнитьЗначенияСвойств(Ключ,ТекущиеДанные);
	ИзменитьАктивностьЗадания(Ключ,НЕ ТекущиеДанные.Включено);
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьВыполнениеНаСервере(Задание)
	ОписаниеОшибки = "";
	Если ПланировщикЗаданийСервер.УдалитьЗаданиеИзПуллаНемедленно(Задание,ОписаниеОшибки)=Истина Тогда
		Сообщить("Успешно!");
	Иначе
		Сообщить("Ошибка!"+Символы.ПС+ОписаниеОшибки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнение(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОтменитьВыполнениеНаСервере(ТекущиеДанные.Задание);
КонецПроцедуры
